{'Job Page': 'https://careers.microsoft.com/us/en/job/1257279/B-BBEE-Executive', 'Job Title': 'B-BBEE-Executive', 'Job Description': "Responsibilities\n\n**Key performance areas**\n\nIn addition to having a strong understanding of the B-BBEE codes, the\nsuccessful incumbent must deliver on the following key performance areas:\n\n**Drive the B-BBEE agenda**\n\n  * Champion for the B-BBEE strategy and for build on the improving the transformation record / profile of Microsoft South Africa.\n  * Work with the Department of Trade, Industry and Competition to design, implement and manage the national EEIP program.\n  * Create the clarity needed within the team through a well-defined strategy and execution plan aligned to the company’s transformational goals.\n  * Responsible for the development, implementation, monitoring and reporting of the B-BBEE strategy. \n  * Acquire stakeholder buy-in for B-BBEE projects. \n  * Represent the company with various industry bodies.. E.g., ITA and SACF. \n  * Participate at company and relevant external engagements as identified. \n  * Ensure that relevant functions are delivering on Employment Equity (EE) as required by the Employment Equity Act. \n  * Identify transformation risks and barriers facing the company and propose solutions to any risks and/or challenges at company level.\n  * Develop and maintain the required infrastructure to ensure the existence of an active and functional EE Forum and B-BBEE Steering Committee and to manage the relevant B-BBEE stakeholders to support the company's compliance with its B-BBEE Strategy. \n\n**Build the B-BBEE scorecard**\n\n  * Continued development and management of Microsoft South Africa’s transformation scorecard. \n  * Develop and implement a plan to achieve the maximum possible points under the B-BBEE scorecard, ensuing alignment with requirements of the relevant legislation.\n  * Establish and manage the internal B-BBEE processes and initiatives.\n  * Provide guidance and direction to stakeholders on matters relating to transformation, procurement, and B- BBEE regulation. \n  * Co-ordinate and guide the company’s approach to procurement in line with the transformation objectives and the procurement policy.\n  * In collaboration with the Procurement Manager, implement strategic initiatives aimed at improving B- BBEE scoring, Supplier Development, Enterprise Development, and the measurement and regular monitoring thereof.\n  * Manage the B-BBEE preparation and auditing process for accreditation by the rating agency and manage annual B-BBEE verification process.\n  * Ensure detailed records and supporting evidence are maintained by various functions e.g., procurement, HR, legal practice teams as required to demonstrate actions around the business B-BBEE activities e.g., list of all businesses that are engaged in the year, BEE status, ownership status, spend and type of contributions made.\n  * Present concise B-BBEE actions and agenda to the Leadership Team and internal stakeholders. Present changes where necessary. \n  * Drive compliance and ensure that the B-BBEE scorecard is monitored and records that relate to the B- BBEE requirements are updated to ensure actions are executed. \n  * Improve the B-BBEE scoring achieved, assign targets to relevant areas and BUs.\n  * Monitoring performance against set targets.\n  * Collaborate with stakeholders to provide direction in line with B-BBEE and implementation guidelines.\n  * Review all relevant policies and operating procedures to ensure alignment to current B-BBEE Codes.\n  * Build awareness with internal stakeholders on changes that may occur within regulations. \n\n", 'Minimum qualification': '', 'Preferred qualification': "Qualifications\n\n  * 8+ years B-BBEE Transformation Experience\n    * Bachelor's Degree in Business Administration, or related field AND 5+ years related experience\n  * B-BEEE audit experience with an accredited verification agency will be an advantage\n  * Be fluent in underlying legislation particularly the B-BBEE Codes of Good Practice, the BEE Act, Employment Equity Act, Skills Development Act. Understanding and knowledge of King IV, Companies Act, Role of SEC and other supporting legislation.\n  * Financial understanding for the purposes of understanding the B-BBEE scorecard.\n  * 5+ years’ experience with planning, budgeting, and other project management activities will be an advantage.\n  * 2+ years people management experience.\n  * Relevant B-BEEE short course qualifications would be preferable.\n  * Strong Leadership, communication, influencing and business Partnership capabilities.\n  * Demonstrated people management capabilities managing remote, diverse, multi-cultural teams.\n  * Ability to work at multiple altitudes, from operational details to strategy definition.\n\nMicrosoft is an equal opportunity employer. All qualified applicants will\nreceive consideration for employment without regard to age, ancestry, color,\nfamily or medical care leave, gender identity or expression, genetic\ninformation, marital status, medical condition, national origin, physical or\nmental disability, political affiliation, protected veteran status, race,\nreligion, sex (including pregnancy), sexual orientation, or any other\ncharacteristic protected by applicable laws, regulations and ordinances.\n\n\n\nBenefits/perks listed below may vary depending on the nature of your\nemployment with Microsoft and the country where you work.\n\n", 'Salary': '', 'Job Type': 'Individual Contributor Full-Time', 'Contract Period': '', 'Skills needed': 'not implemented yet', 'Benefits': '##  Benefits and Perks\n\n  * __ Industry leading healthcare\n  * __ Savings and investments\n  * __ Giving programs\n  * __ Educational resources\n  * __ Maternity and paternity leave\n  * __ Opportunities to network and connect\n  * __ Discounts on products and services\n  * __ Generous time away\n', 'Vacation policy': '', 'Certifications required': '', 'Linguistic Language required': ''}